# Lambda Functions in Python
---
### Agenda:

#### Task 1: what is Lambda expression?
#### Task 2: Lambda expressions and lists
    - what is map function?
    - map function and lambda
#### Task 3: Lambda expressions combined if else statement 
    - what is filter function ?
#### Task 4: Lambda expressions and sorting 
    - sorting a list of tuples using Lambda 
    - sorting a list of dictionaries using Lambda
#### Task 5: Data Manipulation and Exploration using Lambda Expressions

### Task 1: What is Lambda Expression ?

- Let's define a python function:  get two numerical variables as an input, and calculate the multiplication of two values and return it.

In [1]:
def mul(a,b):
    r=a*b
    return r

mul(4,5)

20

- let's define a lambda expression with the same purpose

<img src="images/lambdaa.png" >

In [2]:
mul_lambda = lambda a,b: a*b

- let's check the variable type

In [3]:
mul_lambda

- let's call the lambda

In [4]:
mul_lambda(8,5)

40

- example : define a lambda function: gets a value and return square of the value

In [5]:
square = lambda value: value**2
square(3)

9

- example : define lambda function: gets three values and return a list containing those values

In [6]:
to_list = lambda v1,v2,v3: [v1,v2,v3]
to_list(3,4,5)

[3, 4, 5]

- example : define lambda function : gets a string and return the first character of the string

In [7]:
first_char = lambda string: string[0]
first_char("Hello")

'H'

- Exercise : define a lambda function: gets a string and return the length of it

In [8]:
Lenght = lambda string: len(string)
Lenght("Hello")

5

### Task 2: Lambda Functions and Lists

- let's define a normal function: get's a list, return a list of all values to the power of 2

In [9]:
numbers = [1,2,3,10,9,3,4,10,7]

In [10]:
def list_sqaure (list_):
    new_list = []
    for element in list_:
        new_list.append(element**2)
    return new_list

list_sqaure(numbers)

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- let's use map function

In [11]:
def func(element):
    return element**2
list(map(func, numbers))

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- map function and lambda

In [12]:
func_lambda = lambda element: element**2
list(map(func_lambda, numbers))

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- let's make it even more compact

In [13]:
list(map(lambda element: element **2, numbers))

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- example: I have a list of words, let's use map function to convert all the words into upper case.

In [14]:
words = ["football","python","java","coffee","keyboard"]

In [15]:
list(map(lambda word: word.upper(), words))

['FOOTBALL', 'PYTHON', 'JAVA', 'COFFEE', 'KEYBOARD']

- Exercise : we have a list of sentences, use map function and lambda to convert all the sentences into lower case.

In [16]:
sentences = [
    "Today is Thursday and weather Is Sunny.",
    "Tomorrow at 14 PM, Meeting with Daniel.",
    "Python is a powerfull Tool For DataScience.",
    "Tommy Called Today, He told me He does not feel Good... I think It's COVID!"
]

In [17]:
list(map(lambda sentence: sentence.lower(), sentences))

['today is thursday and weather is sunny.',
 'tomorrow at 14 pm, meeting with daniel.',
 'python is a powerfull tool for datascience.',
 "tommy called today, he told me he does not feel good... i think it's covid!"]

### Task 3 : Lambda Expression combined with if statement

- let's define a normal function: gets a value and return true of the value is even, return false if the value is odd

In [18]:
def isEven(value):
    if value%2==0:
        return True
    else:
        return False
        
isEven(5)

False

- let's define a lambda with same purpose

In [19]:
isEven_lambda = lambda value: True if value%2==0 else False
isEven_lambda(3)

False

- consider a list of numbers, define a normal function : gets a list of numbers and create a new list that contains only the even numbers from our input list

In [20]:
numbers = [1,2,3,10,9,3,4,10,7]

In [21]:
def filter_even(list_):
    new_list = []
    for element in list_:
        if element %2==0:
            new_list.append(element)
    return new_list
    
filter_even(numbers)

[2, 10, 4, 10]

- let's use filter function

In [22]:
def func(element):
    if element %2==0:
        return True
    else:
        return False
list(filter(func, numbers))

[2, 10, 4, 10]

In [23]:
list(filter(lambda element: True if element%2==0 else False, numbers))

[2, 10, 4, 10]

- example: I have a list of names, let's use filter function and lambda to filter out the names starting with 'A'

In [24]:
names = ["John","Alex","Maiki","Alice","Layla","Hanna","Alexander","Anil","Angela","Lola","Thelma","Clara"]

In [25]:
list(filter(lambda name: name if name[0]=="A" else "", names))

['Alex', 'Alice', 'Alexander', 'Anil', 'Angela']

In [26]:
list(filter(lambda name: True if name[0]=="A" else False, names))

['Alex', 'Alice', 'Alexander', 'Anil', 'Angela']

- example: use filter and lambda function to filter out the names that starts with an 'A' and with the length of 4

In [27]:
list(filter(lambda name: name if name[0]=="A" and len(name)==4 else "", names))

['Alex', 'Anil']

- exercise: we have a list of numbers, use map function and lambda to multiply the odd values by 10 and the even values by 100 in our numbers list

In [28]:
numbers = [1,2,3,10,9,3,4,10,7]

In [29]:
func = lambda number: number*100 if number%2==0 else number*10
list(map(func, numbers))

[10, 200, 30, 1000, 90, 30, 400, 1000, 70]

In [30]:
list(map(lambda number: number*100 if number %2==0 else number*10, numbers))

[10, 200, 30, 1000, 90, 30, 400, 1000, 70]

### Task 4: Lambda expressions and sorting

#### Sorting a list of tuples 
- Let's say we have a list of products with their respective prices, stored as a tupple in a list.

In [31]:
products = [
    ("Cheese",1.50),
    ("Banana Bread",2.10),
    ("Chicken Meat",3.50),
    ("Apple Juice",0.45),
    ("Orange Juice",1.25),
    ("Milk",0.75),
    ("Mango",1.25)
]

- Let's sort the list based on the prices

In [32]:
products.sort()
products

[('Apple Juice', 0.45),
 ('Banana Bread', 2.1),
 ('Cheese', 1.5),
 ('Chicken Meat', 3.5),
 ('Mango', 1.25),
 ('Milk', 0.75),
 ('Orange Juice', 1.25)]

In [33]:
products.sort(key = lambda element: element[1])
products

[('Apple Juice', 0.45),
 ('Milk', 0.75),
 ('Mango', 1.25),
 ('Orange Juice', 1.25),
 ('Cheese', 1.5),
 ('Banana Bread', 2.1),
 ('Chicken Meat', 3.5)]

#### Sorting a list of dictionaries 
- Let's say we have a list of 7 person with their information (name, age, Income) stored in a dictionary.

In [34]:
persons = [
    {"Name" : "Jake" , "Age" : 23 , "Income"  : 450 },
    {"Name" : "Maria" , "Age"  : 32 , "Income"  : 2550 },
    {"Name" : "Will" , "Age"  : 43 , "Income"  : 4500 },
    {"Name" : "Layla" , "Age"  : 12 , "Income"  : 0 },
    {"Name" : "Mina" , "Age"  : 35 , "Income"  : 2100 },
    {"Name" : "Lola" , "Age"  : 28 , "Income"  : 450 },
    {"Name" : "Thelma" , "Age"  : 23 , "Income"  : 450 },
]

- sort the list based on each person's age

In [35]:
persons.sort(key= lambda person: person["Age"])
persons

[{'Name': 'Layla', 'Age': 12, 'Income': 0},
 {'Name': 'Jake', 'Age': 23, 'Income': 450},
 {'Name': 'Thelma', 'Age': 23, 'Income': 450},
 {'Name': 'Lola', 'Age': 28, 'Income': 450},
 {'Name': 'Maria', 'Age': 32, 'Income': 2550},
 {'Name': 'Mina', 'Age': 35, 'Income': 2100},
 {'Name': 'Will', 'Age': 43, 'Income': 4500}]

- Exercise: sort the list based on each person's income

In [36]:
persons.sort(key = lambda person: person["Income"])
persons

[{'Name': 'Layla', 'Age': 12, 'Income': 0},
 {'Name': 'Jake', 'Age': 23, 'Income': 450},
 {'Name': 'Thelma', 'Age': 23, 'Income': 450},
 {'Name': 'Lola', 'Age': 28, 'Income': 450},
 {'Name': 'Mina', 'Age': 35, 'Income': 2100},
 {'Name': 'Maria', 'Age': 32, 'Income': 2550},
 {'Name': 'Will', 'Age': 43, 'Income': 4500}]

### Task 5: Data Manipulation and Exploration using Lambda Expressions
- we have dataframe containing of information related to 11 Employees who are working in a technology company

In [37]:
import pandas as pd 
dataframe = pd.DataFrame({
    'Name':['Jeremy','Frank','Janet','Ryan','Mary',"John","Alex","Maiki","Alice","Layla","Hanna"],
    'Hourly Wage' : [6,7,22,10,32,10,29,10,12,10,30],
    'Type of contract' : ["Part-Time","Part-Time","Full-Time","Part-Time",
                          "Full-Time","Part-Time","Full-Time","Part-Time",
                          "Part-Time","Part-Time","Full-Time"]
})
dataframe

      Name  Hourly Wage Type of contract
0   Jeremy            6        Part-Time
1    Frank            7        Part-Time
2    Janet           22        Full-Time
3     Ryan           10        Part-Time
4     Mary           32        Full-Time
5     John           10        Part-Time
6     Alex           29        Full-Time
7    Maiki           10        Part-Time
8    Alice           12        Part-Time
9    Layla           10        Part-Time
10   Hanna           30        Full-Time

- let's add a column "Daily Working Hours", containing of number of hours each employee works in a day, based on their contract type. 
#### Assume that  : 
    - part-time job working hours : 20 hours per week (4 hours per day)
    - full-time job working hours : 40 hours per week (8 hours per day)

In [38]:
dataframe['Daily Working Hours'] = dataframe['Type of contract'].apply(lambda element: 4 if element =="Part-Time" else 8)
dataframe

      Name  Hourly Wage Type of contract  Daily Working Hours
0   Jeremy            6        Part-Time                    4
1    Frank            7        Part-Time                    4
2    Janet           22        Full-Time                    8
3     Ryan           10        Part-Time                    4
4     Mary           32        Full-Time                    8
5     John           10        Part-Time                    4
6     Alex           29        Full-Time                    8
7    Maiki           10        Part-Time                    4
8    Alice           12        Part-Time                    4
9    Layla           10        Part-Time                    4
10   Hanna           30        Full-Time                    8

- Let's add a column "Annual Income", calculate Annual income of each employee

In [39]:
dataframe['Annual Income'] = dataframe.apply(lambda row : row["Daily Working Hours"]*row["Hourly Wage"]*365, axis = 1)
dataframe

      Name  Hourly Wage Type of contract  Daily Working Hours  Annual Income
0   Jeremy            6        Part-Time                    4           8760
1    Frank            7        Part-Time                    4          10220
2    Janet           22        Full-Time                    8          64240
3     Ryan           10        Part-Time                    4          14600
4     Mary           32        Full-Time                    8          93440
5     John           10        Part-Time                    4          14600
6     Alex           29        Full-Time                    8          84680
7    Maiki           10        Part-Time                    4          14600
8    Alice           12        Part-Time                    4          17520
9    Layla           10        Part-Time                    4          14600
10   Hanna           30        Full-Time                    8          87600

- Exercise: Add a column "Annual Tax Amount", for each person calculate how much tax they pay each a year based on the annual income
#### Personal income tax rates  :
    - if the annual income is more than 64000, the tax rate would be 35%
    - if the annual income is less than 64000, the tax rate would be 0%

In [40]:
dataframe['Annual Tax %'] = dataframe['Annual Income'].apply(lambda tax: 0.35 if tax>64000 else 0 )
dataframe['Annual Tax %']
dataframe

,Name,Hourly Wage,Type of contract,Daily Working Hours,Annual Income,Annual Tax %
0,Jeremy,6,Part-Time,4,8760,0.00
1,Frank,7,Part-Time,4,10220,0.00
2,Janet,22,Full-Time,8,64240,0.35
3,Ryan,10,Part-Time,4,14600,0.00
4,Mary,32,Full-Time,8,93440,0.35
5,John,10,Part-Time,4,14600,0.00
6,Alex,29,Full-Time,8,84680,0.35
7,Maiki,10,Part-Time,4,14600,0.00
8,Alice,12,Part-Time,4,17520,0.00
9,Layla,10,Part-Time,4,14600,0.00
10,Hanna,30,Full-Time,8,87600,0.35

In [41]:
dataframe['Annual Tax Amount'] = dataframe.apply(lambda row: row['Annual Income']*row['Annual Tax %'], axis = 1)
dataframe

,Name,Hourly Wage,Type of contract,Daily Working Hours,Annual Income,Annual Tax %,Annual Tax Amount
0,Jeremy,6,Part-Time,4,8760,0.00,0.0
1,Frank,7,Part-Time,4,10220,0.00,0.0
2,Janet,22,Full-Time,8,64240,0.35,22484.0
3,Ryan,10,Part-Time,4,14600,0.00,0.0
4,Mary,32,Full-Time,8,93440,0.35,32704.0
5,John,10,Part-Time,4,14600,0.00,0.0
6,Alex,29,Full-Time,8,84680,0.35,29638.0
7,Maiki,10,Part-Time,4,14600,0.00,0.0
8,Alice,12,Part-Time,4,17520,0.00,0.0
9,Layla,10,Part-Time,4,14600,0.00,0.0
10,Hanna,30,Full-Time,8,87600,0.35,30660.0

In [42]:
dataframe['Annual Tax amount'] = dataframe['Annual Income'].apply(lambda e: e*35/100 if e >64000 else 0)
dataframe

,Name,Hourly Wage,Type of contract,Daily Working Hours,Annual Income,Annual Tax %,Annual Tax Amount,Annual Tax amount
0,Jeremy,6,Part-Time,4,8760,0.00,0.0,0.0
1,Frank,7,Part-Time,4,10220,0.00,0.0,0.0
2,Janet,22,Full-Time,8,64240,0.35,22484.0,22484.0
3,Ryan,10,Part-Time,4,14600,0.00,0.0,0.0
4,Mary,32,Full-Time,8,93440,0.35,32704.0,32704.0
5,John,10,Part-Time,4,14600,0.00,0.0,0.0
6,Alex,29,Full-Time,8,84680,0.35,29638.0,29638.0
7,Maiki,10,Part-Time,4,14600,0.00,0.0,0.0
8,Alice,12,Part-Time,4,17520,0.00,0.0,0.0
9,Layla,10,Part-Time,4,14600,0.00,0.0,0.0
10,Hanna,30,Full-Time,8,87600,0.35,30660.0,30660.0